#include<bits/stdc++.h>///制作人：大飞哥哥
#include<windows.h>
#include <time.h>
#include <conio.h>//控制台输入输出头文件
using namespace std;
int flag=0,markl=6,markr=3,Flag=0;///flag判断电梯是否停
int tiao=0;///判断跳起状态
int dun=0;///判断蹲下状态
int qiang=0;///判断枪口朝向：1 上 2下 3左 4右
int map0[40][40]={
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,1,
0,0,0,0,0,0,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,0,0,0,0,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,0,0,0,0,8,8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,7,7,7,7,7,7,7,7,7,7,7,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
7,7,7,7,7,7,7,7,7,7,7,7,7,7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
4,4,0,4,4,0,4,4,0,4,4,0,4,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
4,4,0,4,4,0,4,4,0,4,4,0,4,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,1,1,1,1,0,0,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1
};
int color(int c) 	//SetConsoleTextAttribute是API设置控制台窗口字体颜色和背景色的函数
{
    SetConsoleTextAttribute(GetStdHandle(STD_OUTPUT_HANDLE), c);        //更改文字颜色
    return 0;
}
void explation()
{
    system("cls");
    cout<<" w a s d控制方向；j跳跃，k换子弹，L发射子弹"<<endl;
}
void print()
{
    if(map0[markl+1][markr]==2&&flag==0)
    {
        for(int i=0;i<40;i++)
        {
            for(int j=0;j<40;j++)
            {
                if(map0[i][j]==2)
                {
                    map0[i-1][j]=2;
                    map0[i][j]=0;
                    if(i-1==20) flag=1;
                }


            }
        }
        markl--;
    }
    if(dun==0&&tiao==0)
    {map0[markl][markr]=5;
    map0[markl-1][markr]=5;}
    else
    {
        map0[markl][markr]=5;
    }
    system("cls");
    if(flag)
    {
        for(int i=7;i<=20;i++)
        {
            for(int j=0; j<=25; j++)
            {
                                color(0);
                if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
            }
            cout<<endl;
        }
    }
    else{
    if(markl<10)
    {
        if(markr<10)
        {
            for(int i=0;i<15;i++)
            {
                for(int j=0;j<26;j++)
                {
                                    color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
        else if(markr>24)
        {
            for(int i=0;i<15;i++)
            {
                for(int j=14;j<40;j++)
                {
                                    color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
        else{
            for(int i=0;i<15;i++)
            {
                for(int j=markr-10; j<=markr+15; j++)
                {
                                    color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
    }
    else if(markl>35)
    {
        if(markr<10)
        {
            for(int i=25;i<40;i++)
            {
                for(int j=0;j<26;j++)
                {
                     color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
        else if(markr>24)
        {
            for(int i=25;i<40;i++)
            {
                for(int j=14;j<40;j++)
                {
                    color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
        else {
            for(int i=25;i<40;i++)
            {
                for(int j=markr-10; j<=markr+15; j++)
                {
                    color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
    }
    else
    {
        if(markr<10)
        {
            for(int i=markl-10; i<=markl+4; i++)
            {
                for(int j=0;j<26;j++)
                {
                     color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
        else if(markr>24)
        {
            for(int i=markl-10; i<=markl+4; i++)
            {
                for(int j=14;j<40;j++)
                {
                    color(0);
                    if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
                }
                cout<<endl;
            }
        }
        else{
        for(int i=markl-10; i<=markl+4; i++)
        {
            for(int j=markr-10; j<=markr+15; j++)
            {
                color(0);
                if(map0[i][j]==0) cout<<" ";
                    color(10);
                    if(map0[i][j]==1) cout<<"=";
                    color(3);
                    if(map0[i][j]==2) cout<<"~";
                    color(14);
                    if(map0[i][j]==4) cout<<"$";
                    color(21);
                    if(map0[i][j]==7) cout<<"&";
                    color(8);
                    if(map0[i][j]==8) cout<<"*";
                    color(18);
                    if(map0[i][j]==5) cout<<"@";
                    color(0);
            }
            cout<<endl;
        }
        }
    }
    }
}
void hidden(){
HANDLE hOut = GetStdHandle(STD_OUTPUT_HANDLE);
CONSOLE_CURSOR_INFO cci;
GetConsoleCursorInfo(hOut, &cci);
cci.bVisible = FALSE;
SetConsoleCursorInfo(hOut, &cci);
}
void run()
{
    hidden();
    ///int key;
    if(map0[20][4]==2) flag=1;
    print();
    if (kbhit())//如果用户按下了键盘中的某个键
    {
        ///fflush(stdin);//清空缓冲区的字符

        //getch()读取方向键的时候，会返回两次，第一次调用返回0或者224，第二次调用返回的才是实际值
        ///key = _getch();//第一次调用返回的不是实际值
        ///key = _getch();//第二次调用返回实际值

        switch (getch())
        {
        case 'a':
            if(map0[markl][markr-1]==0&&dun==0)
            {


                map0[markl][markr]=0;
                map0[markl-1][markr]=0;
                markr--;
            }
            //往左
            qiang=3;
            break;
        case 'A':
            if(map0[markl][markr-1]==0&&dun==0)
            {map0[markl][markr]=0;
            map0[markl-1][markr]=0;
            markr--;}//往左
            qiang=3;
            break;
        case 'd':
            if(map0[markl][markr+1]==0&&dun==0)
            {map0[markl][markr]=0;
            map0[markl-1][markr]=0;
            markr++;}//往右
            qiang=4;
            break;
        case 'D':
            if(map0[markl][markr+1]==0&&dun==0)
            {map0[markl][markr]=0;
            map0[markl-1][markr]=0;
            markr++;}//往右
            qiang=4;
            break;
        case 'w':
            qiang=1;
            break;
        case 'W':
            qiang=1;
            dun=0;
            break;
        case 's':
            if(tiao==0)
            {dun=1;
            map0[markl-1][markr]=0;
            qiang=2;}
            break;
        case 'S':
            dun=1;
            qiang=2;
            break;
        case 'j':///跳跃
            if(dun==0&&tiao==0)
            {tiao=1;
            map0[markl][markr]=0;
            map0[markl-1][markr]=0;
            markl=markl-3;}
            break;

        case 'k':///换子弹
            break;


        case 'l':///发射子弹
            break;



        }
    }
	if(map0[markl+1][markr]!=1&&map0[markl+1][markr]!=2)
    {
        map0[markl][markr]=0;
	    map0[markl-1][markr]=0;
        markl++;
    }
    if(map0[markl+1][markr]==1||map0[markl+1][markr]==2) tiao=0;
	Sleep(100);
	dun=0;
}
void gotoxy(int x,int y)

{

    COORD c;

    c.X=x;

    c.Y=y;

    SetConsoleCursorPosition(GetStdHandle(STD_OUTPUT_HANDLE),c);
}



void welcometogame()
{
    int n=20;
    int x[23][30]={
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,0,1,0,0,0,0,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,0,1,1,0,0,0,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,0,0,1,1,0,1,0,1,0,0,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,0,0,1,1,0,1,0,0,1,0,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,0,1,0,0,1,0,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,1,1,1,1,1,1,0,1,0,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,1,1,0,1,1,1,1,1,1,0,1,0,0,0,0,1,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,1,1,1,1,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,1,1,1,1,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,0,0,1,1,1,1,1,1,0,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,0,0,0,0,1,1,1,1,1,1,0,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,1,1,0,0,1,1,0,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,1,1,0,0,1,1,0,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0,0,1,1,0,0,1,1,0,1,1,0,0,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,
    0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1
    };


    color(11);
    while(n<30)
    {
        Sleep(1000);
        system("cls");
        for(int i=0; i<23; i++)
        {
            for(int j=n-19; j<=n; j++)
            {
                if(x[i][j]==1)
                    cout<<"#";
                else
                    cout<<" ";
            }
            cout<<endl;
        }
        n++;
    }
    color(10);
    gotoxy(35, 22);
    printf("1.开始游戏");
    gotoxy(55, 22);
    printf("2.游戏说明");
    gotoxy(35, 24);
    printf("3.退出游戏");
    gotoxy(29,27);
    color(3);
    printf("请选择[1 2 3]:[ ]\b\b");
    color(14);
    scanf("%d", &n); 		//输入选项
    switch (n)
    {
    case 1:					//选择开始游戏
        system("cls");
        while(!Flag) run();
        break;
    case 2:					//选择游戏说明
        explation();
        break;
    case 3:					//选择退出游戏
        exit(0);     		//退出游戏
        break;
    default:				//输入非1~3之间的选项
        welcometogame();
    }
}
int main()
{
    welcometogame();
}

